burning-server/app/controllers/flights_controller.rb

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("flight_number", "origin", "destination", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["flight_number", "7472"], ["origin", "copenhagen"], ["destination", "oslo"], ["date", "2022-08-13"], ["created_at", "2022-08-09 23:26:17.695864"], ["updated_at", "2022-08-09 23:26:17.695864"]]

  def update
    respond_to do |format|
      if @flight.update(flight_params)
---
UPDATE "flights" SET "plane_id" = $1, "updated_at" = $2 WHERE "flights"."id" = $3  [["plane_id", "2"], ["updated_at", "2022-08-10 01:28:36.152028"], ["id", 4]]

  def destroy
    @flight.destroy
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 5]]