burning-server/app/controllers/planes_controller.rb

SELECT "planes".* FROM "planes"
---
  def index
    @planes = Plane.all

INSERT INTO "planes" ("name", "rows", "columns", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "747"], ["rows", "50"], ["columns", "4"], ["created_at", "2022-08-09 23:31:07.597279"], ["updated_at", "2022-08-09 23:31:07.597279"]]
---
  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save

SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_plane
      @plane = Plane.find(params[:id])