burning-server/app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("user_id", "flight_id", "row", "column", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["flight_id", 3], ["row", "35"], ["column", "a"], ["created_at", "2022-08-10 01:03:28.459121"], ["updated_at", "2022-08-10 01:03:28.459121"]]

  def update
    respond_to do |format|
      if @reservation.update(reservation_params)
---
UPDATE "reservations" SET "user_id" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["user_id", 0], ["updated_at", "2022-08-10 01:38:59.349943"], ["id", 4]]

  def destroy
    @reservation.destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 1]]