burning-server/app/views/reservations/_form.html.erb

SELECT "users"."user", "users"."id" FROM "users"
---
    <%= form.label :user_id %>
    <%= form.select :user_id, User.pluck(:user, :id) %>

SELECT "flights"."flight_number", "flights"."id" FROM "flights"
---
    <%= form.label :flight_id %>
    <%= form.select :flight_id, Flight.pluck(:flight_number, :id) %>