burning-server/app/views/flights/_form.html.erb

    <%= form.label :plane %>
    <%= form.select :plane_id, Plane.pluck(:name, :id) %>
---
SELECT "planes"."name", "planes"."id" FROM "planes"